function Point = abandonnPoint(Point)
%每次读入单个点需要 30,103这种

%lefttop:103.928865,30.758234 _>103.919381,30.747484
[k_lt,b_lt]=linearCoefficient([103.928865,30.758234],[103.919381,30.747484]);
%righttop:103.932074,30.758737-銆103.940164,30.753371
[k_rt,b_rt]=linearCoefficient([103.932074,30.758737],[103.940164,30.753371]);
%rightbottom:103.937312,30.745567-銆?103.939909,30.749988
[k_rb,b_rb]=linearCoefficient([103.937312,30.745567],[103.939909,30.749988]);
%leftbottom:103.924613,30.743489-銆?103.928346,30.741571
[k_lb,b_lb]=linearCoefficient([103.924613,30.743489],[103.928346,30.741571]);
%工地上 103.921395,30.748947 103.922548,30.748209
[k_gdu,b_gdu]=linearCoefficient([103.921395,30.748947],[103.922548,30.748209]);
%工地下 103.924775,30.746697 103.923755,30.744314
[k_gdd,b_gdd]=linearCoefficient([103.924775,30.746697],[103.923755,30.744314]);
%工地中心点 103.921057,30.747559 103.921057,30.747559
Point(find(k_lt*Point(:,2)+b_lt<Point(:,1)),:)=[];
Point(find(k_rt*Point(:,2)+b_rt<Point(:,1)),:)=[];
Point(find(k_rb*Point(:,2)+b_rb>Point(:,1)),:)=[];
Point(find(k_lb*Point(:,2)+b_lb>Point(:,1)),:)=[];
%Point(find((Point(:,2)-103.921218)^2+(Point(:,1)-30.747375)^2< (103.921057-103.921057)^2+(30.747559-30.747559)^2)=[];
%Point(find(k_gdd*Point(:,2)+b_gdd<Point(:,1)),:)=[];

end